[
  {
    "id": "أعمال-شركة-رحاب-في-إعاشة-الحجيج-بالفنادق-لموسم-حج-1446هـ",
    "slug": "أعمال-شركة-رحاب-في-إعاشة-الحجيج-بالفنادق-لموسم-حج-1446هـ",
    "title": "أعمال شركة رحاب في إعاشة الحجيج بالفنادق لموسم حج 1446هـ",
    "description": "The video showcases the food catering services provided by Rehab Company for Hajj pilgrims in various hotels during the 1446 AH season. It includes sh...",
    "content": "The video showcases the food catering services provided by Rehab Company for Hajj pilgrims in various hotels during the 1446 AH season. It includes shots of large-scale meal preparation, buffet setups, and staff serving pilgrims. The video highlights the scale of operations, mentioning they served breakfast and dinner to over 2,900 pilgrims at the Al-Muhammadiyah Hotel and 700 pilgrims at the Al-Jaber Hotel over a 20-day period.",
    "videoUrl": "https://www.youtube.com/watch?v=yr1ztd1-gGg",
    "heroImage": "https://img.youtube.com/vi/yr1ztd1-gGg/maxresdefault.jpg",
    "galleryImages": []
  },
  {
    "id": "أعمال-شركة-رحاب-في-مقاولات-وتجهيزات-المشاعر-المقدسة-لموسم-حج-1446هـ",
    "slug": "أعمال-شركة-رحاب-في-مقاولات-وتجهيزات-المشاعر-المقدسة-لموسم-حج-1446هـ",
    "title": "أعمال شركة رحاب في مقاولات وتجهيزات المشاعر المقدسة لموسم حج 1446هـ",
    "description": "This video focuses on the contracting and equipment preparation provided by Rehab Company at the Holy Sites (Mina, Arafat, Muzdalifah) for the 1446 AH...",
    "content": "This video focuses on the contracting and equipment preparation provided by Rehab Company at the Holy Sites (Mina, Arafat, Muzdalifah) for the 1446 AH Hajj season. It shows the installation of tents, cooling systems (fans and AC), lighting, carpets, and medical clinics. The video provides specific statistics on the equipment deployed, such as over 30,000 carpets, 8,000 sunshades, 122,000 pilgrim mattresses, and thousands of fans and water coolers.",
    "videoUrl": "https://www.youtube.com/watch?v=RfcqW904jOg",
    "heroImage": "https://img.youtube.com/vi/RfcqW904jOg/maxresdefault.jpg",
    "galleryImages": []
  },
  {
    "id": "وجبة-العشاء-المقدمة-لحجاج-الحج-المباشر-بفندق-بركة-اليقين-15-ذي-الحجة",
    "slug": "وجبة-العشاء-المقدمة-لحجاج-الحج-المباشر-بفندق-بركة-اليقين-15-ذي-الحجة",
    "title": "وجبة العشاء المقدمة لحجاج الحج المباشر بفندق بركة اليقين 15 ذي الحجة",
    "description": "This video documents the dinner meal provided to pilgrims at the Barakat Al-Yaqeen Hotel on the 15th of Dhu al-Hijjah, 1446 AH. It shows the catering ...",
    "content": "This video documents the dinner meal provided to pilgrims at the Barakat Al-Yaqeen Hotel on the 15th of Dhu al-Hijjah, 1446 AH. It shows the catering team setting up the dining hall, the variety of food offered in the buffet, and the pilgrims enjoying their meal. The focus is on the quality and organization of the dinner service for approximately 1,000 pilgrims.",
    "videoUrl": "https://www.youtube.com/watch?v=DVRgXUfGxHI",
    "heroImage": "https://img.youtube.com/vi/DVRgXUfGxHI/maxresdefault.jpg",
    "galleryImages": []
  },
  {
    "id": "وجبة-العشاء-المقدمة-لحجاج-الحج-المباشر-بفندق-أبراج-الجابر-16-ذي-الحجة",
    "slug": "وجبة-العشاء-المقدمة-لحجاج-الحج-المباشر-بفندق-أبراج-الجابر-16-ذي-الحجة",
    "title": "وجبة العشاء المقدمة لحجاج الحج المباشر بفندق أبراج الجابر 16 ذي الحجة",
    "description": "This video showcases the dinner service for pilgrims at the Abraj Al-Jaber Hotel on the 16th of Dhu al-Hijjah, 1446 AH. Similar to the other hotel vid...",
    "content": "This video showcases the dinner service for pilgrims at the Abraj Al-Jaber Hotel on the 16th of Dhu al-Hijjah, 1446 AH. Similar to the other hotel videos, it highlights the professional catering staff, the diverse menu items (including appetizers, main courses, and desserts), and the overall dining environment provided for the pilgrims.",
    "videoUrl": "https://www.youtube.com/watch?v=B13_smPg8KI",
    "heroImage": "https://img.youtube.com/vi/B13_smPg8KI/maxresdefault.jpg",
    "galleryImages": []
  },
  {
    "id": "وجبة-العشاء-المقدمة-لحجاج-الحج-المباشر-بفندق-المحمدية-14-ذي-الحجة",
    "slug": "وجبة-العشاء-المقدمة-لحجاج-الحج-المباشر-بفندق-المحمدية-14-ذي-الحجة",
    "title": "وجبة العشاء المقدمة لحجاج الحج المباشر بفندق المحمدية 14 ذي الحجة",
    "description": "The video features the dinner meal served to pilgrims at the Al-Muhammadiyah Hotel on the 14th of Dhu al-Hijjah, 1446 AH. It includes interviews or te...",
    "content": "The video features the dinner meal served to pilgrims at the Al-Muhammadiyah Hotel on the 14th of Dhu al-Hijjah, 1446 AH. It includes interviews or testimonials from pilgrims expressing their satisfaction with the food quality and service provided by Rehab Company. The video emphasizes the company's commitment to hospitality and serving the guests of Allah.",
    "videoUrl": "https://www.youtube.com/watch?v=rLTrd_RFSAE",
    "heroImage": "https://img.youtube.com/vi/rLTrd_RFSAE/maxresdefault.jpg",
    "galleryImages": []
  },
  {
    "id": "أعمال-شركة-رحاب-في-إعاشة-الحجيج-بالمشاعر-المقدسة-لموسم-حج-1446هـ",
    "slug": "أعمال-شركة-رحاب-في-إعاشة-الحجيج-بالمشاعر-المقدسة-لموسم-حج-1446هـ",
    "title": "أعمال شركة رحاب في إعاشة الحجيج بالمشاعر المقدسة لموسم حج 1446هـ",
    "description": "The video highlights the company's catering efforts at the Holy Sites (Mina and Arafat) for the 1446 AH Hajj season. It shows the logistical process o...",
    "content": "The video highlights the company's catering efforts at the Holy Sites (Mina and Arafat) for the 1446 AH Hajj season. It shows the logistical process of transporting hot, pre-packed meals in insulated containers to pilgrim camps. Staff are seen distributing meal boxes, fresh fruit, large quantities of ice bags, and bottled water to pilgrims inside their tents, using electronic devices to manage distribution.",
    "videoUrl": "https://www.youtube.com/watch?v=oVAqba0zFbA",
    "heroImage": "https://img.youtube.com/vi/oVAqba0zFbA/maxresdefault.jpg",
    "galleryImages": []
  },
  {
    "id": "مخيمات-الهند-في-مشعر-عرفات-بعد-اكتمال-جميع-التجهيزات-لموسم-حج-1446هـ",
    "slug": "مخيمات-الهند-في-مشعر-عرفات-بعد-اكتمال-جميع-التجهيزات-لموسم-حج-1446هـ",
    "title": "مخيمات الهند في مشعر عرفات بعد اكتمال جميع التجهيزات لموسم حج 1446هـ",
    "description": "This video displays the completed preparations for the Indian pilgrim camps in Arafat. It shows the infrastructure including fully equipped tents, sop...",
    "content": "This video displays the completed preparations for the Indian pilgrim camps in Arafat. It shows the infrastructure including fully equipped tents, sophisticated cooling systems, clean restroom facilities, a medical clinic with necessary equipment, and various safety features like fire extinguishers and emergency exits.",
    "videoUrl": "https://www.youtube.com/watch?v=FRCjMNGnyyI",
    "heroImage": "https://img.youtube.com/vi/FRCjMNGnyyI/maxresdefault.jpg",
    "galleryImages": []
  },
  {
    "id": "مخيمات-الهند-في-مشعر-منى-بعد-اكتمال-جميع-التجهيزات-لموسم-حج-1446هـ",
    "slug": "مخيمات-الهند-في-مشعر-منى-بعد-اكتمال-جميع-التجهيزات-لموسم-حج-1446هـ",
    "title": "مخيمات الهند في مشعر منى بعد اكتمال جميع التجهيزات لموسم حج 1446هـ",
    "description": "The video provides a look at the Indian camps in Mina after all preparations were finished. The footage highlights the cooling solutions deployed (ind...",
    "content": "The video provides a look at the Indian camps in Mina after all preparations were finished. The footage highlights the cooling solutions deployed (industrial fans and evaporative coolers), organized tent rows, the supply of water coolers, and the distribution of mattresses for the pilgrims' stay.",
    "videoUrl": "https://www.youtube.com/watch?v=xxuONoYiH5s",
    "heroImage": "https://img.youtube.com/vi/xxuONoYiH5s/maxresdefault.jpg",
    "galleryImages": []
  },
  {
    "id": "مشروع-تجهيز-مخيمات-الهند-مشعر-عرفة-لعام-1446هـ",
    "slug": "مشروع-تجهيز-مخيمات-الهند-مشعر-عرفة-لعام-1446هـ",
    "title": "مشروع تجهيز مخيمات الهند ( مشعر عرفة ) لعام 1446هـ",
    "description": "This video focuses on the active preparation phase for the Indian pilgrim camps in Arafat. It shows a large team of workers unloading trucks and insta...",
    "content": "This video focuses on the active preparation phase for the Indian pilgrim camps in Arafat. It shows a large team of workers unloading trucks and installing essential equipment, including thousands of mattresses, water coolers, large standing fans, and wall-to-wall carpeting to prepare the tents for the upcoming pilgrims.",
    "videoUrl": "https://www.youtube.com/watch?v=GY_Dx2W_-Ac",
    "heroImage": "https://img.youtube.com/vi/GY_Dx2W_-Ac/maxresdefault.jpg",
    "galleryImages": []
  },
  {
    "id": "مشروع-تجهيز-مخيمات-الهند-مشعر-منى-لعام-1446هـ",
    "slug": "مشروع-تجهيز-مخيمات-الهند-مشعر-منى-لعام-1446هـ",
    "title": "مشروع تجهيز مخيمات الهند ( مشعر منى ) لعام 1446هـ",
    "description": "The video documents the ongoing preparation works at the Indian pilgrim camps in Mina for the 1446 AH season. Footage includes workers unloading mater...",
    "content": "The video documents the ongoing preparation works at the Indian pilgrim camps in Mina for the 1446 AH season. Footage includes workers unloading materials from trucks, setting up tent structures, installing air conditioning ducts, and arranging interior furnishings like carpets and mattresses to ensure a comfortable stay for the pilgrims.",
    "videoUrl": "https://www.youtube.com/watch?v=g7Zn241mlY4",
    "heroImage": "https://img.youtube.com/vi/g7Zn241mlY4/maxresdefault.jpg",
    "galleryImages": []
  },
  {
    "id": "تهنئة-شركة-رحاب-بمناسبة-حلول-عيد-الفطر-لعام-1446هـ",
    "slug": "تهنئة-شركة-رحاب-بمناسبة-حلول-عيد-الفطر-لعام-1446هـ",
    "title": "تهنئة شركة رحاب بمناسبة حلول عيد الفطر لعام 1446هـ",
    "description": "This is a festive greeting video from Rehab Company celebrating Eid al-Fitr 1446 AH. It features staff members dressed in traditional Saudi attire, ex...",
    "content": "This is a festive greeting video from Rehab Company celebrating Eid al-Fitr 1446 AH. It features staff members dressed in traditional Saudi attire, exchanging greetings, and working collaboratively in a professional office environment, accompanied by a celebratory song.",
    "videoUrl": "https://www.youtube.com/watch?v=6Bz8cPQMPV0",
    "heroImage": "https://img.youtube.com/vi/6Bz8cPQMPV0/maxresdefault.jpg",
    "galleryImages": []
  },
  {
    "id": "استعداد-الموظفين-والعاملين-لتوفير-وجبات-الحجاج-لحج-1445هـ",
    "slug": "استعداد-الموظفين-والعاملين-لتوفير-وجبات-الحجاج-لحج-1445هـ",
    "title": "استعداد الموظفين والعاملين لتوفير وجبات الحجاج لحج 1445هـ",
    "description": "The video shows the logistical preparations and staff readiness for providing catering services during the 1445 AH Hajj season. It includes shots of s...",
    "content": "The video shows the logistical preparations and staff readiness for providing catering services during the 1445 AH Hajj season. It includes shots of staff being organized, receiving uniforms and supplies, and boarding buses to transport them to various service locations at the Holy Sites.",
    "videoUrl": "https://www.youtube.com/watch?v=cZWrr5CPPyQ",
    "heroImage": "https://img.youtube.com/vi/cZWrr5CPPyQ/maxresdefault.jpg",
    "galleryImages": []
  },
  {
    "id": "8-ذي-الحجة-تجهيز-وجبات-الافطار-والغداء-والعشاء-للحجاج-1445-هـ",
    "slug": "8-ذي-الحجة-تجهيز-وجبات-الافطار-والغداء-والعشاء-للحجاج-1445-هـ",
    "title": "8 ذي الحجة تجهيز وجبات الافطار والغداء والعشاء للحجاج 1445 هـ",
    "description": "This video focuses on the mass meal preparation and distribution for pilgrims on the 8th of Dhu al-Hijjah, 1445 AH (the Day of Tarwiyah) in Mina. It s...",
    "content": "This video focuses on the mass meal preparation and distribution for pilgrims on the 8th of Dhu al-Hijjah, 1445 AH (the Day of Tarwiyah) in Mina. It shows industrial kitchens operating at full capacity, staff packaging individual meal boxes, and the distribution process to pilgrims in their camps, ensuring timely access to breakfast, lunch, and dinner.",
    "videoUrl": "https://www.youtube.com/watch?v=IhkjELk7L80",
    "heroImage": "https://img.youtube.com/vi/IhkjELk7L80/maxresdefault.jpg",
    "galleryImages": []
  },
  {
    "id": "9-ذي-الحجة-تجهيز-وجبات-الافطار-والغداء-والعشاء-للحجاج-1445-هـ",
    "slug": "9-ذي-الحجة-تجهيز-وجبات-الافطار-والغداء-والعشاء-للحجاج-1445-هـ",
    "title": "9 ذي الحجة تجهيز وجبات الافطار والغداء والعشاء للحجاج 1445 هـ",
    "description": "The video documents the catering operations on the 9th of Dhu al-Hijjah, 1445 AH (the Day of Arafat). It highlights the challenges of serving large nu...",
    "content": "The video documents the catering operations on the 9th of Dhu al-Hijjah, 1445 AH (the Day of Arafat). It highlights the challenges of serving large numbers of pilgrims in Arafat, showing the preparation of hot meals in field kitchens and staff distributing breakfast boxes, lunch, and refreshing drinks to pilgrims inside their tents during the peak of the Hajj.",
    "videoUrl": "https://www.youtube.com/watch?v=vS8XFv24QIU",
    "heroImage": "https://img.youtube.com/vi/vS8XFv24QIU/maxresdefault.jpg",
    "galleryImages": []
  },
  {
    "id": "10-ذي-الحجة-تجهيز-وجبات-الافطار-والغداء-والعشاء-للحجاج-1445-هـ",
    "slug": "10-ذي-الحجة-تجهيز-وجبات-الافطار-والغداء-والعشاء-للحجاج-1445-هـ",
    "title": "10 ذي الحجة تجهيز وجبات الافطار والغداء والعشاء للحجاج 1445 هـ",
    "description": "This video documents the catering operations on the 10th of Dhu al-Hijjah, 1445 AH (the Day of Eid al-Adha). It shows the preparation and distribution...",
    "content": "This video documents the catering operations on the 10th of Dhu al-Hijjah, 1445 AH (the Day of Eid al-Adha). It shows the preparation and distribution of meals to pilgrims in Mina during the Hajj season.",
    "videoUrl": "https://www.youtube.com/watch?v=-OXAJADxP9I",
    "heroImage": "https://img.youtube.com/vi/-OXAJADxP9I/maxresdefault.jpg",
    "galleryImages": []
  },
  {
    "id": "12-ذي-الحجة-تجهيز-وجبات-الافطار-والغداء-والعشاء-للحجاج-1445-هـ",
    "slug": "12-ذي-الحجة-تجهيز-وجبات-الافطار-والغداء-والعشاء-للحجاج-1445-هـ",
    "title": "12 ذي الحجة تجهيز وجبات الافطار والغداء والعشاء للحجاج 1445 هـ",
    "description": "Catering services and meal preparation for pilgrims on the 12th of Dhu al-Hijjah, 1445 AH, focusing on the quality and efficiency of service in the Ho...",
    "content": "Catering services and meal preparation for pilgrims on the 12th of Dhu al-Hijjah, 1445 AH, focusing on the quality and efficiency of service in the Holy Sites.",
    "videoUrl": "https://www.youtube.com/watch?v=bCGlAzOhMQQ",
    "heroImage": "https://img.youtube.com/vi/bCGlAzOhMQQ/maxresdefault.jpg",
    "galleryImages": []
  },
  {
    "id": "11-ذي-الحجة-تجهيز-وجبات-الافطار-والغداء-والعشاء-للحجاج-1445-هـ",
    "slug": "11-ذي-الحجة-تجهيز-وجبات-الافطار-والغداء-والعشاء-للحجاج-1445-هـ",
    "title": "11 ذي الحجة تجهيز وجبات الافطار والغداء والعشاء للحجاج 1445 هـ",
    "description": "Documentation of the meal preparation and distribution process for pilgrims on the 11th of Dhu al-Hijjah, 1445 AH, during the Hajj season....",
    "content": "Documentation of the meal preparation and distribution process for pilgrims on the 11th of Dhu al-Hijjah, 1445 AH, during the Hajj season.",
    "videoUrl": "https://www.youtube.com/watch?v=mDQBB6YBaDo",
    "heroImage": "https://img.youtube.com/vi/mDQBB6YBaDo/maxresdefault.jpg",
    "galleryImages": []
  },
  {
    "id": "برومو-تجهيزات-المكتب-للحج-لعام-١٤٤٥هـ",
    "slug": "برومو-تجهيزات-المكتب-للحج-لعام-١٤٤٥هـ",
    "title": "برومو تجهيزات المكتب للحج لعام ١٤٤٥هـ",
    "description": "A promotional video showcasing the office preparations and readiness for the Hajj season of 1445 AH....",
    "content": "A promotional video showcasing the office preparations and readiness for the Hajj season of 1445 AH.",
    "videoUrl": "https://www.youtube.com/watch?v=rC7lBkef0ok",
    "heroImage": "https://img.youtube.com/vi/rC7lBkef0ok/maxresdefault.jpg",
    "galleryImages": []
  }
]