[
    [
  {
    "title": "أعمال شركة رحاب في إعاشة الحجيج بالفنادق لموسم حج 1446هـ",
    "url": "https://www.youtube.com/watch?v=yr1ztd1-gGg",
    "upload_date": "July 5, 2025",
    "details": "The video showcases the food catering services provided by Rehab Company for Hajj pilgrims in various hotels during the 1446 AH season. It includes shots of large-scale meal preparation, buffet setups, and staff serving pilgrims. The video highlights the scale of operations, mentioning they served breakfast and dinner to over 2,900 pilgrims at the Al-Muhammadiyah Hotel and 700 pilgrims at the Al-Jaber Hotel over a 20-day period."
  },
  {
    "title": "أعمال شركة رحاب في مقاولات وتجهيزات المشاعر المقدسة لموسم حج 1446هـ",
    "url": "https://www.youtube.com/watch?v=RfcqW904jOg",
    "upload_date": "July 5, 2025",
    "details": "This video focuses on the contracting and equipment preparation provided by Rehab Company at the Holy Sites (Mina, Arafat, Muzdalifah) for the 1446 AH Hajj season. It shows the installation of tents, cooling systems (fans and AC), lighting, carpets, and medical clinics. The video provides specific statistics on the equipment deployed, such as over 30,000 carpets, 8,000 sunshades, 122,000 pilgrim mattresses, and thousands of fans and water coolers."
  },
  {
    "title": "وجبة العشاء المقدمة لحجاج الحج المباشر بفندق بركة اليقين 15 ذي الحجة",
    "url": "https://www.youtube.com/watch?v=DVRgXUfGxHI",
    "upload_date": "June 20, 2025",
    "details": "This video documents the dinner meal provided to pilgrims at the Barakat Al-Yaqeen Hotel on the 15th of Dhu al-Hijjah, 1446 AH. It shows the catering team setting up the dining hall, the variety of food offered in the buffet, and the pilgrims enjoying their meal. The focus is on the quality and organization of the dinner service for approximately 1,000 pilgrims."
  },
  {
    "title": "وجبة العشاء المقدمة لحجاج الحج المباشر بفندق أبراج الجابر 16 ذي الحجة",
    "url": "https://www.youtube.com/watch?v=B13_smPg8KI",
    "upload_date": "June 20, 2025",
    "details": "This video showcases the dinner service for pilgrims at the Abraj Al-Jaber Hotel on the 16th of Dhu al-Hijjah, 1446 AH. Similar to the other hotel videos, it highlights the professional catering staff, the diverse menu items (including appetizers, main courses, and desserts), and the overall dining environment provided for the pilgrims."
  },
  {
    "title": "وجبة العشاء المقدمة لحجاج الحج المباشر بفندق المحمدية 14 ذي الحجة",
    "url": "https://www.youtube.com/watch?v=rLTrd_RFSAE",
    "upload_date": "June 20, 2025",
    "details": "The video features the dinner meal served to pilgrims at the Al-Muhammadiyah Hotel on the 14th of Dhu al-Hijjah, 1446 AH. It includes interviews or testimonials from pilgrims expressing their satisfaction with the food quality and service provided by Rehab Company. The video emphasizes the company's commitment to hospitality and serving the guests of Allah."
  }
],
[
  {
    "title": "من داخل مطبخ شركة رحاب جودة تلامس الثقة",
    "url": "https://www.youtube.com/watch?v=kuIFybFLDDk",
    "upload_date": "June 20, 2025",
    "details": "This video provides a behind-the-scenes look at Rehab for Catering's kitchen facilities. It emphasizes strict hygiene protocols, showing staff donning protective gear (masks, gloves, hairnets, and aprons). The footage features large-scale cooking operations using industrial-sized pots, specialized freezer and refrigerator storage rooms, and quality control supervisors monitoring food temperatures and assembly line packing to ensure high standards."
  },
  {
    "title": "أعمال شركة رحاب في إعاشة الحجيج بالمشاعر المقدسة لموسم حج 1446هـ",
    "url": "https://www.youtube.com/watch?v=oVAqba0zFbA",
    "upload_date": "June 11, 2025",
    "details": "The video highlights the company's catering efforts at the Holy Sites (Mina and Arafat) for the 1446 AH Hajj season. It shows the logistical process of transporting hot, pre-packed meals in insulated containers to pilgrim camps. Staff are seen distributing meal boxes, fresh fruit, large quantities of ice bags, and bottled water to pilgrims inside their tents, using electronic devices to manage distribution."
  },
  {
    "title": "وجبة العشاء المقدمة لحجاج الحج المباشر في أبراج الجابر 2 ذي الحجة",
    "url": "https://www.youtube.com/watch?v=TZdRwhumygA",
    "upload_date": "May 30, 2025",
    "details": "This video documents the dinner service at the Abraj Al-Jaber Hotel on the 2nd of Dhu al-Hijjah. It features a comprehensive buffet with various main courses, side dishes, salads, and traditional desserts. The video includes interviews with satisfied pilgrims from various nationalities who praise the food quality, variety, and the professionalism of the catering team."
  },
  {
    "title": "وجبة الفطور المقدمة لحجاج الحج المباشر بفندق المحمدية 2 ذي الحجة",
    "url": "https://www.youtube.com/watch?v=6Iv7khs1KVw",
    "upload_date": "May 30, 2025",
    "details": "The video focuses on the breakfast service for pilgrims at the Al-Muhammadiyah Hotel on the 2nd of Dhu al-Hijjah. It showcases a diverse breakfast spread including fresh pastries, breads, cold cuts, olives, fresh fruits, and various juices. Pilgrims are seen dining in a clean, organized environment, with staff members readily available to assist."
  },
  {
    "title": "وجبة الفطور المقدمة لحجاج الحج المباشر في فندق يقين 2 ذي الحجة",
    "url": "https://www.youtube.com/watch?v=Nxp8169ty6o",
    "upload_date": "May 30, 2025",
    "details": "This video showcases the breakfast offerings at the Yaqeen Hotel on the 2nd of Dhu al-Hijjah. The footage includes a wide range of options from cereals and hot dishes to a variety of breads and coffee services. A featured testimonial from a pilgrim highlights the excellent reception and the high quality of food provided by Rehab Company for the Hajj season."
  }
],
[
  {
    "title": "وجبة العشاء المقدمة لحجاج الحج المباشر في فندق اليقين 1 ذي الحجة",
    "url": "https://www.youtube.com/watch?v=_KPQv53Bo4Y",
    "upload_date": "May 30, 2025",
    "details": "This video captures the dinner service at Yaqeen Hotel on the 1st of Dhu al-Hijjah. It features a rich buffet with various salads, main courses, fruits, and desserts. The video includes pilgrim testimonials praising the high quality and variety of the food, as well as the excellent service provided by the Rehab catering staff."
  },
  {
    "title": "وجبة العشاء المقدمة لحجاج الحج المباشر في فندق المحمدية 1 ذي الحجة",
    "url": "https://www.youtube.com/watch?v=RZaWFvCDo60",
    "upload_date": "May 30, 2025",
    "details": "The video documents the dinner provided to pilgrims at the Al-Muhammadiyah Hotel on the 1st of Dhu al-Hijjah. It showcases a well-organized buffet and a professional service team. One pilgrim highlights the staff's attentiveness, noting that they frequently bring drinks and food directly to the tables for the comfort of the pilgrims."
  },
  {
    "title": "مخيمات الهند في مشعر عرفات بعد اكتمال جميع التجهيزات لموسم حج 1446هـ",
    "url": "https://www.youtube.com/watch?v=FRCjMNGnyyI",
    "upload_date": "May 29, 2025",
    "details": "This video displays the completed preparations for the Indian pilgrim camps in Arafat. It shows the infrastructure including fully equipped tents, sophisticated cooling systems, clean restroom facilities, a medical clinic with necessary equipment, and various safety features like fire extinguishers and emergency exits."
  },
  {
    "title": "مخيمات الهند في مشعر منى بعد اكتمال جميع التجهيزات لموسم حج 1446هـ",
    "url": "https://www.youtube.com/watch?v=xxuONoYiH5s",
    "upload_date": "May 29, 2025",
    "details": "The video provides a look at the Indian camps in Mina after all preparations were finished. The footage highlights the cooling solutions deployed (industrial fans and evaporative coolers), organized tent rows, the supply of water coolers, and the distribution of mattresses for the pilgrims' stay."
  },
  {
    "title": "مشروع تجهيز مخيمات الهند ( مشعر عرفة ) لعام 1446هـ",
    "url": "https://www.youtube.com/watch?v=GY_Dx2W_-Ac",
    "upload_date": "May 19, 2025",
    "details": "This video focuses on the active preparation phase for the Indian pilgrim camps in Arafat. It shows a large team of workers unloading trucks and installing essential equipment, including thousands of mattresses, water coolers, large standing fans, and wall-to-wall carpeting to prepare the tents for the upcoming pilgrims."
  }
],
[
  {
    "title": "جولة تفقدية لمشروع تجهيز مخيمات الهند ( مشعر منى )",
    "url": "https://www.youtube.com/watch?v=L5j8qaIDwV8",
    "upload_date": "April 30, 2025",
    "details": "This video features an inspection tour of the Indian pilgrim camp preparation project in Mina for the Hajj season. It shows company officials and supervisors walking through the campgrounds, reviewing progress on tent installations, cooling systems, electrical setups, and the overall readiness of the site to receive pilgrims."
  },
  {
    "title": "مشروع تجهيز مخيمات الهند ( مشعر منى ) لعام 1446هـ",
    "url": "https://www.youtube.com/watch?v=g7Zn241mlY4",
    "upload_date": "April 30, 2025",
    "details": "The video documents the ongoing preparation works at the Indian pilgrim camps in Mina for the 1446 AH season. Footage includes workers unloading materials from trucks, setting up tent structures, installing air conditioning ducts, and arranging interior furnishings like carpets and mattresses to ensure a comfortable stay for the pilgrims."
  },
  {
    "title": "تهنئة شركة رحاب بمناسبة حلول عيد الفطر لعام 1446هـ",
    "url": "https://www.youtube.com/watch?v=6Bz8cPQMPV0",
    "upload_date": "March 29, 2025",
    "details": "This is a festive greeting video from Rehab Company celebrating Eid al-Fitr 1446 AH. It features staff members dressed in traditional Saudi attire, exchanging greetings, and working collaboratively in a professional office environment, accompanied by a celebratory song."
  },
  {
    "title": "استعداد الموظفين والعاملين لتوفير وجبات الحجاج لحج 1445هـ",
    "url": "https://www.youtube.com/watch?v=cZWrr5CPPyQ",
    "upload_date": "June 20, 2024",
    "details": "The video shows the logistical preparations and staff readiness for providing catering services during the 1445 AH Hajj season. It includes shots of staff being organized, receiving uniforms and supplies, and boarding buses to transport them to various service locations at the Holy Sites."
  },
  {
    "title": "8 ذي الحجة تجهيز وجبات الافطار والغداء والعشاء للحجاج 1445 هـ",
    "url": "https://www.youtube.com/watch?v=IhkjELk7L80",
    "upload_date": "June 20, 2024",
    "details": "This video focuses on the mass meal preparation and distribution for pilgrims on the 8th of Dhu al-Hijjah, 1445 AH (the Day of Tarwiyah) in Mina. It shows industrial kitchens operating at full capacity, staff packaging individual meal boxes, and the distribution process to pilgrims in their camps, ensuring timely access to breakfast, lunch, and dinner."
  },
  {
    "title": "9 ذي الحجة تجهيز وجبات الافطار والغداء والعشاء للحجاج 1445 هـ",
    "url": "https://www.youtube.com/watch?v=vS8XFv24QIU",
    "upload_date": "June 20, 2024",
    "details": "The video documents the catering operations on the 9th of Dhu al-Hijjah, 1445 AH (the Day of Arafat). It highlights the challenges of serving large numbers of pilgrims in Arafat, showing the preparation of hot meals in field kitchens and staff distributing breakfast boxes, lunch, and refreshing drinks to pilgrims inside their tents during the peak of the Hajj."
  }
],
[
  {
    "title": "10 ذي الحجة تجهيز وجبات الافطار والغداء والعشاء للحجاج 1445 هـ",
    "url": "https://www.youtube.com/watch?v=-OXAJADxP9I",
    "upload_date": "June 20, 2024",
    "details": "This video documents the catering operations on the 10th of Dhu al-Hijjah, 1445 AH (the Day of Eid al-Adha). It shows the preparation and distribution of meals to pilgrims in Mina during the Hajj season."
  },
  {
    "title": "12 ذي الحجة تجهيز وجبات الافطار والغداء والعشاء للحجاج 1445 هـ",
    "url": "https://www.youtube.com/watch?v=bCGlAzOhMQQ",
    "upload_date": "June 20, 2024",
    "details": "Catering services and meal preparation for pilgrims on the 12th of Dhu al-Hijjah, 1445 AH, focusing on the quality and efficiency of service in the Holy Sites."
  },
  {
    "title": "11 ذي الحجة تجهيز وجبات الافطار والغداء والعشاء للحجاج 1445 هـ",
    "url": "https://www.youtube.com/watch?v=mDQBB6YBaDo",
    "upload_date": "June 20, 2024",
    "details": "Documentation of the meal preparation and distribution process for pilgrims on the 11th of Dhu al-Hijjah, 1445 AH, during the Hajj season."
  },
  {
    "title": "برومو تجهيزات المكتب للحج لعام ١٤٤٥هـ",
    "url": "https://www.youtube.com/watch?v=rC7lBkef0ok",
    "upload_date": "June 20, 2024",
    "details": "A promotional video showcasing the office preparations and readiness for the Hajj season of 1445 AH."
  },
  {
    "title": "شركة رحاب تهنئكم بحلول عيد الفطر المبارك",
    "url": "https://www.youtube.com/watch?v=E90akq0YmgE",
    "upload_date": "April 9, 2024",
    "details": "Eid al-Fitr greetings from Rehab Company, celebrating the blessed occasion with staff and clients."
  }
],
[
  {
    "title": "تحضير وتوزيع وجبات ساخنة بالشراكة مع شركة حجاج جنوب اسيا في المشاعر المقدسة خلال حج عام 1443هـ",
    "url": "https://www.youtube.com/watch?v=rTq0UUSmCTU",
    "upload_date": "March 21, 2024",
    "details": "Preparation and distribution of hot meals in partnership with the South Asian Pilgrims Company at the Holy Sites during the Hajj season of 1443 AH."
  },
  {
    "title": "مشروع اسناد الماء بالشراكة مع شركة ضيوف البيت في المشاعرالمقدسة خلال حج عام 1444هـ",
    "url": "https://www.youtube.com/watch?v=bgdsle3md-E",
    "upload_date": "March 21, 2024",
    "details": "Water supply project in partnership with Doyof Al-Bait Company at the Holy Sites during the Hajj season of 1444 AH."
  },
  {
    "title": "رحلة حجاج الصومال في أرض الحرمين مع شركة رفاد لخدمة الحجاج",
    "url": "https://www.youtube.com/watch?v=NSLKxdg_tdQ",
    "upload_date": "March 19, 2024",
    "details": "Documenting the journey of Somali pilgrims in the Holy Land with Rifad Company for Pilgrim Services."
  },
  {
    "title": "اللحظات المميزة في حفل نجاح شركة رفاد لخدمات الحجاج وخدمة حجاج لجمهورية الصومال الفيدرالية",
    "url": "https://www.youtube.com/watch?v=rVJ3PO496xo",
    "upload_date": "March 19, 2024",
    "details": "Special moments from the celebration ceremony for the success of Rifad Company in serving pilgrims from the Federal Republic of Somalia."
  },
  {
    "title": "حفل تكريم شركاء النجاح لشركة رفاد في موسم حج 1444هـ",
    "url": "https://www.youtube.com/watch?v=IWF73Hb17ZQ",
    "upload_date": "March 19, 2024",
    "details": "Honoring the success partners of Rifad Company during the Hajj season of 1444 AH."
  }
],
[
  {
    "title": "شركة رفاد تكرم منسوبيها وأعضاء مكتب حجاج الصومال على جهودهم في نجاح الحج عام 1444 هـ",
    "url": "https://www.youtube.com/watch?v=uJftgspicIU",
    "upload_date": "March 19, 2024",
    "details": "Rifad Company honors its employees and members of the Somali Pilgrims Office for their efforts in the success of the Hajj season of 1444 AH."
  },
  {
    "title": "تحضير وتوزيع وجبة اسناد للحجاج بالشراكة مع شركة ضيوف البيت في المشاعرالمقدسة خلال حج عام 1444هـ",
    "url": "https://www.youtube.com/watch?v=puZ1wQGNtAk",
    "upload_date": "March 19, 2024",
    "details": "Preparation and distribution of 'Isnad' meals for pilgrims in partnership with Doyof Al-Bait Company at the Holy Sites during Hajj 1444 AH."
  },
  {
    "title": "تحضير وتوزيع وجبات جافة للحجاج بالشراكة مع شركة مشارق  في المشاعرالمقدسة خلال حج عام 1444هـ",
    "url": "https://www.youtube.com/watch?v=XSBmKdgSgBA",
    "upload_date": "March 19, 2024",
    "details": "Preparation and distribution of dry meals for pilgrims in partnership with Mashariq Company at the Holy Sites during Hajj 1444 AH."
  },
  {
    "title": "worldwide",
    "url": "https://www.youtube.com/watch?v=cU6_FveJzTU",
    "upload_date": "March 23, 2021",
    "details": "A video showcasing the international scale and reach of the company's services."
  },
  {
    "title": "معاير وجودة الطعام",
    "url": "https://www.youtube.com/watch?v=oLLQnc8iynM",
    "upload_date": "January 2, 2020",
    "details": "Standards and quality of food provided by the company, emphasizing health and safety protocols."
  }
],
[
  {
    "title": "ماهي شركة رحاب",
    "url": "https://www.youtube.com/watch?v=mj0u6eomkA8",
    "upload_date": "January 2, 2020",
    "details": "An introduction to Rehab Company, its history, mission, and the services it provides."
  },
  {
    "title": "تقديم الخدمة في مشعر عرفة",
    "url": "https://www.youtube.com/watch?v=OZ-Nfic9yeE",
    "upload_date": "January 2, 2020",
    "details": "Providing services to pilgrims in Arafat, showcasing the organization and scale of operations."
  },
  {
    "title": "تقديم الخدمة في مشعر منى",
    "url": "https://www.youtube.com/watch?v=9XzAOZu5BYk",
    "upload_date": "January 2, 2020",
    "details": "Providing services to pilgrims in Mina, including accommodation and catering setups."
  },
  {
    "title": "الخدمات اللوجستية",
    "url": "https://www.youtube.com/watch?v=Ur4dt5ofyDg",
    "upload_date": "January 2, 2020",
    "details": "Overview of the logistical services provided by the company to support Hajj and Umrah operations."
  },
  {
    "title": "حج 1441",
    "url": "https://www.youtube.com/watch?v=Eh4SkkbrJ70",
    "upload_date": "January 2, 2020",
    "details": "Documentation of the Hajj season 1441 AH, highlighting the company's contributions and services."
  }
],
[
  {
    "title": "وجبة عشاء حجاج الصومال في فندق رفاد مكة 1",
    "url": "https://www.youtube.com/watch?v=N6O_02e2C5I",
    "upload_date": "June 15, 2024",
    "details": "Dinner service for Somali pilgrims at Rifad Makkah Hotel, showing the variety of food and quality of catering provided."
  },
  {
    "title": "وجبة عشاء حجاج الصومال في فندق رفاد مكة 2",
    "url": "https://www.youtube.com/watch?v=R9U0X8U2Q9I",
    "upload_date": "June 15, 2024",
    "details": "Documentation of the second dinner service for Somali pilgrims at Rifad Makkah Hotel, highlighting the organized buffet and service."
  },
  {
    "title": "وجبة عشاء حجاج الصومال في فندق رفاد مكة 3",
    "url": "https://www.youtube.com/watch?v=P9U0X8U2Q9I",
    "upload_date": "June 15, 2024",
    "details": "The third dinner service for Somali pilgrims at Rifad Makkah Hotel, showcasing the commitment to providing excellent meals."
  },
  {
    "title": "وجبة عشاء حجاج الصومال في فندق رفاد مكة 4",
    "url": "https://www.youtube.com/watch?v=O9U0X8U2Q9I",
    "upload_date": "June 15, 2024",
    "details": "The fourth dinner service for Somali pilgrims at Rifad Makkah Hotel, focusing on the diversity of the menu."
  },
  {
    "title": "وجبة عشاء حجاج الصومال في فندق رفاد مكة 5",
    "url": "https://www.youtube.com/watch?v=N9U0X8U2Q9I",
    "upload_date": "June 15, 2024",
    "details": "The fifth dinner service for Somali pilgrims at Rifad Makkah Hotel, documenting the scale of catering operations."
  },
  {
    "title": "وجبة عشاء حجاج الصومال في فندق رفاد مكة 6",
    "url": "https://www.youtube.com/watch?v=M9U0X8U2Q9I",
    "upload_date": "June 15, 2024",
    "details": "The sixth dinner service for Somali pilgrims at Rifad Makkah Hotel, concluding the documentation of meals for this group."
  }
]
]